-- [SQL문법] 3. HR 스키마 - ERD 만들기

-- ERD란?
-- 개체-관계 다이어그램의 약자로 개체와 개체 사이의 관계를 도표(다이어그램)로
-- 표현하는 방법

-- 데이터모델링 단계
-- 1) 요구사항 수집 및 분석
-- 2) 개념 모델링 : 뼈대를 만드는 단계
--                테이블, 컬럼, 테이블과 테이블의 관계
--                피터첸 방식의 ERD 그려짐.
-- 3) 논리 모델링 : 개념모델링 결과를 구체화 시키는 단계
--                데이터타입, 컬럼사이즈, 제약조건 등
--                IE 표기법의 ERD와 테이블 차트 그려짐.
-- 4) 물리 모델링 : DB에 테이블을 생성하는 단계(create table ---;)

-- 리버스 모델링
-- 현재 DB 내 테이블을 기반으로 ERD를 그려주는 작업
-- DB 내 테이블들의 전체 관계를 파악하기 좋음.

-- ERD 그리기
-- [Home] - [Models] - [Create EER Model from Database]

